burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_dac.h
/* DAC output channel definitions */
#define DAC_OUT0                          ((uint8_t)0x00U)                     /*!< DACx_OUT0 channel */
#define DAC_OUT1                          ((uint8_t)0x01U)                     /*!< DACx_OUT1 channel */

/* DAC interrupt */
#define DAC_INT_DDUDR0                    DAC_CTL0_DDUDRIE0                    /*!< DACx_OUT0 DMA underrun interrupt */
#define DAC_INT_FIFOOVR0                  DAC_CTL1_FIFOOVRIE0                  /*!< DACx_OUT0 FIFO overflow interrupt */
#define DAC_INT_FIFOUDR0                  DAC_CTL1_FIFOUDRIE0                  /*!< DACx_OUT0 FIFO underflow interrupt */
#define DAC_INT_DDUDR1                    DAC_CTL0_DDUDRIE1                    /*!< DACx_OUT1 DMA underrun interrupt */
#define DAC_INT_FIFOOVR1                  DAC_CTL1_FIFOOVRIE1                  /*!< DACx_OUT1 FIFO overflow interrupt */
#define DAC_INT_FIFOUDR1                  DAC_CTL1_FIFOUDRIE1                  /*!< DACx_OUT1 FIFO underflow interrupt */

/* DAC interrupt flag */
#define DAC_INT_FLAG_DDUDR0               DAC_STAT0_DDUDR0                     /*!< DACx_OUT0 DMA underrun interrupt flag */
#define DAC_INT_FLAG_FIFOOVR0             DAC_STAT1_FIFOOVR0                   /*!< DACx_OUT0 FIFO overflow interrupt flag */
#define DAC_INT_FLAG_FIFOUDR0             DAC_STAT1_FIFOUDR0                   /*!< DACx_OUT0 FIFO underflow interrupt flag */
#define DAC_INT_FLAG_DDUDR1               DAC_STAT0_DDUDR1                     /*!< DACx_OUT1 DMA underrun interrupt flag */
#define DAC_INT_FLAG_FIFOOVR1             DAC_STAT1_FIFOOVR1                   /*!< DACx_OUT1 FIFO overflow interrupt flag */
#define DAC_INT_FLAG_FIFOUDR1             DAC_STAT1_FIFOUDR1                   /*!< DACx_OUT1 FIFO underflow interrupt flag */

/* DAC flags */
#define DAC_FLAG_DDUDR0                   DAC_STAT0_DDUDR0                     /*!< DACx_OUT0 DMA underrun flag */
#define DAC_FLAG_FIFOF0                   DAC_STAT1_FIFOF0                     /*!< DACx_OUT0 FIFO full flag */
#define DAC_FLAG_FIFOE0                   DAC_STAT1_FIFOE0                     /*!< DACx_OUT0 FIFO empty flag */
#define DAC_FLAG_FIFOOVR0                 DAC_STAT1_FIFOOVR0                   /*!< DACx_OUT0 FIFO overflow flag */
#define DAC_FLAG_FIFOUDR0                 DAC_STAT1_FIFOUDR0                   /*!< DACx_OUT0 FIFO underflow flag */
#define DAC_FLAG_DDUDR1                   DAC_STAT0_DDUDR1                     /*!< DACx_OUT1 DMA underrun flag */
#define DAC_FLAG_FIFOF1                   DAC_STAT1_FIFOF1                     /*!< DACx_OUT1 FIFO full flag */
#define DAC_FLAG_FIFOE1                   DAC_STAT1_FIFOE1                     /*!< DACx_OUT1 FIFO empty flag */
#define DAC_FLAG_FIFOOVR1                 DAC_STAT1_FIFOOVR1                   /*!< DACx_OUT1 FIFO overflow flag */
#define DAC_FLAG_FIFOUDR1                 DAC_STAT1_FIFOUDR1                   /*!< DACx_OUT1 FIFO underflow flag */

/* function declarations */
/* DAC initialization functions */
/* deinitialize DAC */
void dac_deinit(uint32_t dac_periph);
/* enable DAC */
void dac_enable(uint32_t dac_periph, uint8_t dac_out);
/* disable DAC */
void dac_disable(uint32_t dac_periph, uint8_t dac_out);
/* enable DAC DMA function */
void dac_dma_enable(uint32_t dac_periph, uint8_t dac_out);
/* disable DAC DMA function */
void dac_dma_disable(uint32_t dac_periph, uint8_t dac_out);
/* configure GPIO connection */
void dac_gpio_connect_config(uint32_t dac_periph, uint8_t dac_out, uint32_t gpio_connect);

/* DAC buffer functions */
/* enable DAC output buffer */
void dac_output_buffer_enable(uint32_t dac_periph, uint8_t dac_out);
/* disable DAC output buffer */
void dac_output_buffer_disable(uint32_t dac_periph, uint8_t dac_out);

/* read and write operation functions */
/* get DAC output value */
uint16_t dac_output_value_get(uint32_t dac_periph, uint8_t dac_out);
/* set DAC data holding register value */
void dac_data_set(uint32_t dac_periph, uint8_t dac_out, uint32_t dac_align, uint16_t data);

/* DAC trigger configuration */
/* enable DAC trigger */
void dac_trigger_enable(uint32_t dac_periph, uint8_t dac_out);
/* disable DAC trigger */
void dac_trigger_disable(uint32_t dac_periph, uint8_t dac_out);
/* configure DAC trigger source */
void dac_trigger_source_config(uint32_t dac_periph, uint8_t dac_out, uint32_t triggersource);
/* enable DAC software trigger */
void dac_software_trigger_enable(uint32_t dac_periph, uint8_t dac_out);

/* DAC wave mode configuration */
/* configure DAC wave mode */
void dac_wave_mode_config(uint32_t dac_periph, uint8_t dac_out, uint32_t wave_mode);
/* configure DAC LFSR noise mode */
void dac_lfsr_noise_config(uint32_t dac_periph, uint8_t dac_out, uint32_t unmask_bits);
/* configure DAC triangle noise mode */
void dac_triangle_noise_config(uint32_t dac_periph, uint8_t dac_out, uint32_t amplitude);

/* DAC concurrent mode configuration */
/* enable DAC concurrent mode */
void dac_concurrent_enable(uint32_t dac_periph);
/* disable DAC concurrent mode */
void dac_concurrent_disable(uint32_t dac_periph);
/* enable DAC concurrent software trigger */
void dac_concurrent_software_trigger_enable(uint32_t dac_periph);
/* enable DAC concurrent buffer function */
void dac_concurrent_output_buffer_enable(uint32_t dac_periph);
/* disable DAC concurrent buffer function */
void dac_concurrent_output_buffer_disable(uint32_t dac_periph);
/* set DAC concurrent mode data holding register value */
void dac_concurrent_data_set(uint32_t dac_periph, uint32_t dac_align, uint16_t data0, uint16_t data1);

/* DAC FIFO functions */
/* enable DAC output FIFO */
void dac_output_fifo_enable(uint32_t dac_periph, uint8_t dac_out);
/* disable DAC output FIFO */
void dac_output_fifo_disable(uint32_t dac_periph, uint8_t dac_out);
/* get DAC output FIFO number */
uint16_t dac_output_fifo_number_get(uint32_t dac_periph, uint8_t dac_out);

/* DAC interrupt and flag functions */
/* get DAC flag */
FlagStatus dac_flag_get(uint32_t dac_periph, uint32_t flag);
/* clear DAC flag */
void dac_flag_clear(uint32_t dac_periph, uint32_t flag);
/* enable DAC interrupt */
void dac_interrupt_enable(uint32_t dac_periph, uint32_t interrupt);
/* disable DAC interrupt */
void dac_interrupt_disable(uint32_t dac_periph, uint32_t interrupt);
/* get DAC interrupt flag */
FlagStatus dac_interrupt_flag_get(uint32_t dac_periph, uint32_t int_flag);
/* clear DAC interrupt flag */
void dac_interrupt_flag_clear(uint32_t dac_periph, uint32_t int_flag);

#endif /* GD32E51X_DAC_H */
